app/Http/Controllers/Back/PostController.php

    public function index(){
        // 一覧画面
        /*
            $posts = Post::latest('id')->paginate(20);
            一覧ページのクエリを確認するとレコードの数だけクエリが発行されているのでEager Loadingを使う
        */
        $posts = Post::with('user')->latest('id')->paginate(20);
---
select * from `posts` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `posts`
select * from `users` where `users`.`id` in (1, 2, 3)

    public function update(PostRequest $request, Post $post) {
        if ($post->update($request->all())) {
---
update `posts` set `is_public` = '1', `published_at` = '2021-01-23 22:57:00', `user_id` = 1, `posts`.`updated_at` = '2021-09-20 12:39:30' where `id` = 50