app/Models/Post.php

select * from `posts` where `is_public` = 1 and `posts`.`id` = 101 limit 1
---
    public function scopePublic(Builder $query){
        return $query->where('is_public', true);